### Terraform Plan 📖

<details><summary>Show Plan</summary>

```terraform
[command]/home/runner/work/_temp/e5397d48-f721-412c-97a4-333970556fb1/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster.cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster" "cluster" {
      + access_config             = (known after apply)
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + compute_config            = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = "eks-postech-g57"
      + outpost_config            = (known after apply)
      + platform_version          = (known after apply)
      + region                    = (known after apply)
      + remote_network_config     = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + storage_config            = (known after apply)
      + tags                      = (known after apply)
      + upgrade_policy            = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
      + zonal_shift_config        = (known after apply)
    }

  # data.aws_eks_cluster_auth.auth will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster_auth" "auth" {
      + id     = (known after apply)
      + name   = "eks-postech-g57"
      + region = (known after apply)
      + token  = (sensitive value)
    }

  # aws_dynamodb_table.dynamodb-postech-g57 will be created
  + resource "aws_dynamodb_table" "dynamodb-postech-g57" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "pk"
      + id               = (known after apply)
      + name             = "postech-g57-db"
      + range_key        = "sk"
      + read_capacity    = 20
      + region           = "us-east-1"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = 20

      + attribute {
          + name = "pk"
          + type = "S"
        }
      + attribute {
          + name = "sk"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # aws_eks_access_entry.access_entry will be created
  + resource "aws_eks_access_entry" "access_entry" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "eks-postech-g57"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = [
          + "group-57",
        ]
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::529966364875:user/postech"
      + region            = "us-east-1"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # aws_eks_access_policy_association.access_entry_association will be created
  + resource "aws_eks_access_policy_association" "access_entry_association" {
      + associated_at = (known after apply)
      + cluster_name  = "eks-postech-g57"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::529966364875:user/postech"
      + region        = "us-east-1"

      + access_scope {
          + type = "cluster"
        }
    }

  # aws_eks_cluster.cluster will be created
  + resource "aws_eks_cluster" "cluster" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "eks-postech-g57"
      + platform_version              = (known after apply)
      + region                        = "us-east-1"
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags_all                      = (known after apply)
      + version                       = "1.31"

      + access_config {
          + authentication_mode = "API"
        }

      + kubernetes_network_config (known after apply)

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.node_group will be created
  + resource "aws_eks_node_group" "node_group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "eks-postech-g57"
      + disk_size              = 50
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.medium",
        ]
      + node_group_name        = "nodeg-postech-g57"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + region                 = "us-east-1"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + node_repair_config (known after apply)

      + scaling_config {
          + desired_size = 2
          + max_size     = 3
          + min_size     = 2
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # aws_iam_role.cluster will be created
  + resource "aws_iam_role" "cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:AssumeRole",
                          + "sts:TagSession",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-cluster-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.node will be created
  + resource "aws_iam_role" "node" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-node-group-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "eks-cluster-role"
    }

  # aws_iam_role_policy_attachment.node-AmazonEC2ContainerRegistryReadOnly will be created
  + resource "aws_iam_role_policy_attachment" "node-AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "eks-node-group-role"
    }

  # aws_iam_role_policy_attachment.node-AmazonEKSWorkerNodePolicy will be created
  + resource "aws_iam_role_policy_attachment" "node-AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "eks-node-group-role"
    }

  # aws_iam_role_policy_attachment.node-AmazonEKS_CNI_Policy will be created
  + resource "aws_iam_role_policy_attachment" "node-AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "eks-node-group-role"
    }

  # aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + region   = "us-east-1"
      + tags_all = (known after apply)
      + vpc_id   = (known after apply)
    }

  # aws_route_table.rt_public will be created
  + resource "aws_route_table" "rt_public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-east-1"
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
          + {
              + cidr_block                 = "10.0.0.0/16"
              + gateway_id                 = "local"
                # (11 unchanged attributes hidden)
            },
        ]
      + tags_all         = (known after apply)
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.rt_association_0 will be created
  + resource "aws_route_table_association" "rt_association_0" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.rt_association_1 will be created
  + resource "aws_route_table_association" "rt_association_1" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.rt_association_2 will be created
  + resource "aws_route_table_association" "rt_association_2" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_s3_bucket.bucket-backend-postech-g57 will be created
  + resource "aws_s3_bucket" "bucket-backend-postech-g57" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "tfstate-backend-postech-g57"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "Production"
          + "Name"        = "postech-g57-fiap"
          + "School"      = "FIAP"
          + "Year"        = "2025"
        }
      + tags_all                    = {
          + "Environment" = "Production"
          + "Name"        = "postech-g57-fiap"
          + "School"      = "FIAP"
          + "Year"        = "2025"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_security_group.sg will be created
  + resource "aws_security_group" "sg" {
      + arn                    = (known after apply)
      + description            = "Usado para expor services na internet"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "postech-g57-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.subnet_public[0] will be created
  + resource "aws_subnet" "subnet_public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "postech-g57-fiap"
          + "School"      = "FIAP"
          + "Year"        = "2025"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "postech-g57-fiap"
          + "School"      = "FIAP"
          + "Year"        = "2025"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.subnet_public[1] will be created
  + resource "aws_subnet" "subnet_public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "postech-g57-fiap"
          + "School"      = "FIAP"
          + "Year"        = "2025"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "postech-g57-fiap"
          + "School"      = "FIAP"
          + "Year"        = "2025"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.subnet_public[2] will be created
  + resource "aws_subnet" "subnet_public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.32.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "postech-g57-fiap"
          + "School"      = "FIAP"
          + "Year"        = "2025"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "postech-g57-fiap"
          + "School"      = "FIAP"
          + "Year"        = "2025"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.vpc_fiap will be created
  + resource "aws_vpc" "vpc_fiap" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + region                               = "us-east-1"
      + tags                                 = {
          + "Environment" = "Production"
          + "Name"        = "postech-g57-fiap"
          + "School"      = "FIAP"
          + "Year"        = "2025"
        }
      + tags_all                             = {
          + "Environment" = "Production"
          + "Name"        = "postech-g57-fiap"
          + "School"      = "FIAP"
          + "Year"        = "2025"
        }
    }

Plan: 22 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + subnet_cidr = [
      + "10.0.0.0/20",
      + "10.0.16.0/20",
      + "10.0.32.0/20",
    ]
  + subnet_id   = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + vpc_cidr    = "10.0.0.0/16"
  + vpc_id      = (known after apply)
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # data.aws_eks_cluster.cluster will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_eks_cluster" "cluster" {%0A      + access_config             = (known after apply)%0A      + arn                       = (known after apply)%0A      + certificate_authority     = (known after apply)%0A      + cluster_id                = (known after apply)%0A      + compute_config            = (known after apply)%0A      + created_at                = (known after apply)%0A      + enabled_cluster_log_types = (known after apply)%0A      + endpoint                  = (known after apply)%0A      + id                        = (known after apply)%0A      + identity                  = (known after apply)%0A      + kubernetes_network_config = (known after apply)%0A      + name                      = "eks-postech-g57"%0A      + outpost_config            = (known after apply)%0A      + platform_version          = (known after apply)%0A      + region                    = (known after apply)%0A      + remote_network_config     = (known after apply)%0A      + role_arn                  = (known after apply)%0A      + status                    = (known after apply)%0A      + storage_config            = (known after apply)%0A      + tags                      = (known after apply)%0A      + upgrade_policy            = (known after apply)%0A      + version                   = (known after apply)%0A      + vpc_config                = (known after apply)%0A      + zonal_shift_config        = (known after apply)%0A    }%0A%0A  # data.aws_eks_cluster_auth.auth will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_eks_cluster_auth" "auth" {%0A      + id     = (known after apply)%0A      + name   = "eks-postech-g57"%0A      + region = (known after apply)%0A      + token  = (sensitive value)%0A    }%0A%0A  # aws_dynamodb_table.dynamodb-postech-g57 will be created%0A  + resource "aws_dynamodb_table" "dynamodb-postech-g57" {%0A      + arn              = (known after apply)%0A      + billing_mode     = "PROVISIONED"%0A      + hash_key         = "pk"%0A      + id               = (known after apply)%0A      + name             = "postech-g57-db"%0A      + range_key        = "sk"%0A      + read_capacity    = 20%0A      + region           = "us-east-1"%0A      + stream_arn       = (known after apply)%0A      + stream_label     = (known after apply)%0A      + stream_view_type = (known after apply)%0A      + tags_all         = (known after apply)%0A      + write_capacity   = 20%0A%0A      + attribute {%0A          + name = "pk"%0A          + type = "S"%0A        }%0A      + attribute {%0A          + name = "sk"%0A          + type = "S"%0A        }%0A%0A      + point_in_time_recovery (known after apply)%0A%0A      + server_side_encryption (known after apply)%0A%0A      + ttl (known after apply)%0A    }%0A%0A  # aws_eks_access_entry.access_entry will be created%0A  + resource "aws_eks_access_entry" "access_entry" {%0A      + access_entry_arn  = (known after apply)%0A      + cluster_name      = "eks-postech-g57"%0A      + created_at        = (known after apply)%0A      + id                = (known after apply)%0A      + kubernetes_groups = [%0A          + "group-57",%0A        ]%0A      + modified_at       = (known after apply)%0A      + principal_arn     = "arn:aws:iam::529966364875:user/postech"%0A      + region            = "us-east-1"%0A      + tags_all          = (known after apply)%0A      + type              = "STANDARD"%0A      + user_name         = (known after apply)%0A    }%0A%0A  # aws_eks_access_policy_association.access_entry_association will be created%0A  + resource "aws_eks_access_policy_association" "access_entry_association" {%0A      + associated_at = (known after apply)%0A      + cluster_name  = "eks-postech-g57"%0A      + id            = (known after apply)%0A      + modified_at   = (known after apply)%0A      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"%0A      + principal_arn = "arn:aws:iam::529966364875:user/postech"%0A      + region        = "us-east-1"%0A%0A      + access_scope {%0A          + type = "cluster"%0A        }%0A    }%0A%0A  # aws_eks_cluster.cluster will be created%0A  + resource "aws_eks_cluster" "cluster" {%0A      + arn                           = (known after apply)%0A      + bootstrap_self_managed_addons = true%0A      + certificate_authority         = (known after apply)%0A      + cluster_id                    = (known after apply)%0A      + created_at                    = (known after apply)%0A      + endpoint                      = (known after apply)%0A      + id                            = (known after apply)%0A      + identity                      = (known after apply)%0A      + name                          = "eks-postech-g57"%0A      + platform_version              = (known after apply)%0A      + region                        = "us-east-1"%0A      + role_arn                      = (known after apply)%0A      + status                        = (known after apply)%0A      + tags_all                      = (known after apply)%0A      + version                       = "1.31"%0A%0A      + access_config {%0A          + authentication_mode = "API"%0A        }%0A%0A      + kubernetes_network_config (known after apply)%0A%0A      + upgrade_policy (known after apply)%0A%0A      + vpc_config {%0A          + cluster_security_group_id = (known after apply)%0A          + endpoint_private_access   = false%0A          + endpoint_public_access    = true%0A          + public_access_cidrs       = (known after apply)%0A          + security_group_ids        = (known after apply)%0A          + subnet_ids                = (known after apply)%0A          + vpc_id                    = (known after apply)%0A        }%0A    }%0A%0A  # aws_eks_node_group.node_group will be created%0A  + resource "aws_eks_node_group" "node_group" {%0A      + ami_type               = (known after apply)%0A      + arn                    = (known after apply)%0A      + capacity_type          = (known after apply)%0A      + cluster_name           = "eks-postech-g57"%0A      + disk_size              = 50%0A      + id                     = (known after apply)%0A      + instance_types         = [%0A          + "t3.medium",%0A        ]%0A      + node_group_name        = "nodeg-postech-g57"%0A      + node_group_name_prefix = (known after apply)%0A      + node_role_arn          = (known after apply)%0A      + region                 = "us-east-1"%0A      + release_version        = (known after apply)%0A      + resources              = (known after apply)%0A      + status                 = (known after apply)%0A      + subnet_ids             = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version                = (known after apply)%0A%0A      + node_repair_config (known after apply)%0A%0A      + scaling_config {%0A          + desired_size = 2%0A          + max_size     = 3%0A          + min_size     = 2%0A        }%0A%0A      + update_config {%0A          + max_unavailable = 1%0A        }%0A    }%0A%0A  # aws_iam_role.cluster will be created%0A  + resource "aws_iam_role" "cluster" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = [%0A                          + "sts:AssumeRole",%0A                          + "sts:TagSession",%0A                        ]%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "eks.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "eks-cluster-role"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A%0A      + inline_policy (known after apply)%0A    }%0A%0A  # aws_iam_role.node will be created%0A  + resource "aws_iam_role" "node" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "ec2.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "eks-node-group-role"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A%0A      + inline_policy (known after apply)%0A    }%0A%0A  # aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy will be created%0A  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSClusterPolicy" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"%0A      + role       = "eks-cluster-role"%0A    }%0A%0A  # aws_iam_role_policy_attachment.node-AmazonEC2ContainerRegistryReadOnly will be created%0A  + resource "aws_iam_role_policy_attachment" "node-AmazonEC2ContainerRegistryReadOnly" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"%0A      + role       = "eks-node-group-role"%0A    }%0A%0A  # aws_iam_role_policy_attachment.node-AmazonEKSWorkerNodePolicy will be created%0A  + resource "aws_iam_role_policy_attachment" "node-AmazonEKSWorkerNodePolicy" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"%0A      + role       = "eks-node-group-role"%0A    }%0A%0A  # aws_iam_role_policy_attachment.node-AmazonEKS_CNI_Policy will be created%0A  + resource "aws_iam_role_policy_attachment" "node-AmazonEKS_CNI_Policy" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"%0A      + role       = "eks-node-group-role"%0A    }%0A%0A  # aws_internet_gateway.igw will be created%0A  + resource "aws_internet_gateway" "igw" {%0A      + arn      = (known after apply)%0A      + id       = (known after apply)%0A      + owner_id = (known after apply)%0A      + region   = "us-east-1"%0A      + tags_all = (known after apply)%0A      + vpc_id   = (known after apply)%0A    }%0A%0A  # aws_route_table.rt_public will be created%0A  + resource "aws_route_table" "rt_public" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + region           = "us-east-1"%0A      + route            = [%0A          + {%0A              + cidr_block                 = "0.0.0.0/0"%0A              + gateway_id                 = (known after apply)%0A                # (11 unchanged attributes hidden)%0A            },%0A          + {%0A              + cidr_block                 = "10.0.0.0/16"%0A              + gateway_id                 = "local"%0A                # (11 unchanged attributes hidden)%0A            },%0A        ]%0A      + tags_all         = (known after apply)%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # aws_route_table_association.rt_association_0 will be created%0A  + resource "aws_route_table_association" "rt_association_0" {%0A      + id             = (known after apply)%0A      + region         = "us-east-1"%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # aws_route_table_association.rt_association_1 will be created%0A  + resource "aws_route_table_association" "rt_association_1" {%0A      + id             = (known after apply)%0A      + region         = "us-east-1"%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # aws_route_table_association.rt_association_2 will be created%0A  + resource "aws_route_table_association" "rt_association_2" {%0A      + id             = (known after apply)%0A      + region         = "us-east-1"%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # aws_s3_bucket.bucket-backend-postech-g57 will be created%0A  + resource "aws_s3_bucket" "bucket-backend-postech-g57" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "tfstate-backend-postech-g57"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_region               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = "us-east-1"%0A      + request_payer               = (known after apply)%0A      + tags                        = {%0A          + "Environment" = "Production"%0A          + "Name"        = "postech-g57-fiap"%0A          + "School"      = "FIAP"%0A          + "Year"        = "2025"%0A        }%0A      + tags_all                    = {%0A          + "Environment" = "Production"%0A          + "Name"        = "postech-g57-fiap"%0A          + "School"      = "FIAP"%0A          + "Year"        = "2025"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A%0A      + cors_rule (known after apply)%0A%0A      + grant (known after apply)%0A%0A      + lifecycle_rule (known after apply)%0A%0A      + logging (known after apply)%0A%0A      + object_lock_configuration (known after apply)%0A%0A      + replication_configuration (known after apply)%0A%0A      + server_side_encryption_configuration (known after apply)%0A%0A      + versioning (known after apply)%0A%0A      + website (known after apply)%0A    }%0A%0A  # aws_security_group.sg will be created%0A  + resource "aws_security_group" "sg" {%0A      + arn                    = (known after apply)%0A      + description            = "Usado para expor services na internet"%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "All"%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "HTTP"%0A              + from_port        = 80%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 80%0A            },%0A        ]%0A      + name                   = "postech-g57-sg"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + region                 = "us-east-1"%0A      + revoke_rules_on_delete = false%0A      + tags_all               = (known after apply)%0A      + vpc_id                 = (known after apply)%0A    }%0A%0A  # aws_subnet.subnet_public[0] will be created%0A  + resource "aws_subnet" "subnet_public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.0.0/20"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = true%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + region                                         = "us-east-1"%0A      + tags                                           = {%0A          + "Environment" = "Production"%0A          + "Name"        = "postech-g57-fiap"%0A          + "School"      = "FIAP"%0A          + "Year"        = "2025"%0A        }%0A      + tags_all                                       = {%0A          + "Environment" = "Production"%0A          + "Name"        = "postech-g57-fiap"%0A          + "School"      = "FIAP"%0A          + "Year"        = "2025"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # aws_subnet.subnet_public[1] will be created%0A  + resource "aws_subnet" "subnet_public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.16.0/20"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = true%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + region                                         = "us-east-1"%0A      + tags                                           = {%0A          + "Environment" = "Production"%0A          + "Name"        = "postech-g57-fiap"%0A          + "School"      = "FIAP"%0A          + "Year"        = "2025"%0A        }%0A      + tags_all                                       = {%0A          + "Environment" = "Production"%0A          + "Name"        = "postech-g57-fiap"%0A          + "School"      = "FIAP"%0A          + "Year"        = "2025"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # aws_subnet.subnet_public[2] will be created%0A  + resource "aws_subnet" "subnet_public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1c"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.32.0/20"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = true%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + region                                         = "us-east-1"%0A      + tags                                           = {%0A          + "Environment" = "Production"%0A          + "Name"        = "postech-g57-fiap"%0A          + "School"      = "FIAP"%0A          + "Year"        = "2025"%0A        }%0A      + tags_all                                       = {%0A          + "Environment" = "Production"%0A          + "Name"        = "postech-g57-fiap"%0A          + "School"      = "FIAP"%0A          + "Year"        = "2025"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # aws_vpc.vpc_fiap will be created%0A  + resource "aws_vpc" "vpc_fiap" {%0A      + arn                                  = (known after apply)%0A      + cidr_block                           = "10.0.0.0/16"%0A      + default_network_acl_id               = (known after apply)%0A      + default_route_table_id               = (known after apply)%0A      + default_security_group_id            = (known after apply)%0A      + dhcp_options_id                      = (known after apply)%0A      + enable_dns_hostnames                 = true%0A      + enable_dns_support                   = true%0A      + enable_network_address_usage_metrics = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_tenancy                     = "default"%0A      + ipv6_association_id                  = (known after apply)%0A      + ipv6_cidr_block                      = (known after apply)%0A      + ipv6_cidr_block_network_border_group = (known after apply)%0A      + main_route_table_id                  = (known after apply)%0A      + owner_id                             = (known after apply)%0A      + region                               = "us-east-1"%0A      + tags                                 = {%0A          + "Environment" = "Production"%0A          + "Name"        = "postech-g57-fiap"%0A          + "School"      = "FIAP"%0A          + "Year"        = "2025"%0A        }%0A      + tags_all                             = {%0A          + "Environment" = "Production"%0A          + "Name"        = "postech-g57-fiap"%0A          + "School"      = "FIAP"%0A          + "Year"        = "2025"%0A        }%0A    }%0A%0APlan: 22 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + subnet_cidr = [%0A      + "10.0.0.0/20",%0A      + "10.0.16.0/20",%0A      + "10.0.32.0/20",%0A    ]%0A  + subnet_id   = [%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A    ]%0A  + vpc_cidr    = "10.0.0.0/16"%0A  + vpc_id      = (known after apply)%0A
::debug::stderr: 
::debug::exitcode: 0
```

</details>

*Pushed by: @rachelkozlowsky*